Repository: SaltyMonkey/justclash
Catalog: luci-app-justclash/po/*/justclash.po
Languages: ru

source: Every 15 seconds
ru: Каждые 15 секунд

source: Every 25 seconds
ru: Каждые 25 секунд

source: Every 35 seconds
ru: Каждые 35 секунд

source: Every 45 seconds
ru: Каждые 45 секунд

source: Every 1 minute
ru: Раз в минуту

source: Every minute
ru: Каждую минуту

source: Every 5 minutes
ru: Каждые 5 минут

source: Every 10 minutes
ru: Каждые 10 минут

source: Every 20 minutes
ru: Каждые 20 минут

source: Every hour
ru: Каждый час

source: 5 seconds
ru: 5 секунд

source: 10 seconds
ru: 10 секунд

source: 20 seconds
ru: 20 секунд

source: 40 seconds
ru: 40 секунд

source: For 1 minute
ru: 1 минута

source: For 2 minutes
ru: 2 минуты

source: For 3 minutes
ru: 3 минуты

source: 1024 entries
ru: 1024 записей

source: 2048 entries
ru: 2048 записей

source: 4096 entries
ru: 4096 записей

source: 8192 entries
ru: 8192 записей

source: 16384 entries
ru: 16384 записей

source: Every 24 hours
ru: Каждые 24 часа

source: Every 12 hours
ru: Каждые 12 часов

source: Every 48 hours
ru: Каждые 48 часов

source: Every 72 hours
ru: Каждые 72 часа

source: Every 2 minutes
ru: Каждые 2 минуты

source: Every 3 minutes
ru: Каждые 3 минуты

source: Every 6 minutes
ru: Каждые 6 минут

source: 10 milliseconds
ru: 10 миллисекунд

source: 20 milliseconds
ru: 20 миллисекунд

source: 30 milliseconds
ru: 30 миллисекунд

source: 40 milliseconds
ru: 40 миллисекунд

source: 50 milliseconds
ru: 50 миллисекунд

source: 100 milliseconds
ru: 100 миллисекунд

source: Response code 200
ru: Код ответа 200

source: Response code 204
ru: Код ответа 204

source: 1 second
ru: 1 секунда

source: 2 seconds
ru: 2 секунды

source: 3 seconds
ru: 3 секунды

source: Every 12 minutes
ru: Каждые 12 минут

source: Every 30 minutes
ru: Каждые 30 минут

source: Every 3 hour
ru: Каждые 3 часа

source: Object
ru: JSON объект

source: URL
ru: Ссылка

source: Fallback
ru: Резерв

source: Load balancer
ru: Балансировка

source: URL Test
ru: Тест ссылки

source: Consistent hashing
ru: Согласованное хеширование

source: Round robin
ru: Циклический перебор

source: By rules
ru: По правилам

source: Drop
ru: Блокировать

source: Direct
ru: Напрямую

source: Disabled
ru: Выключено

source: Check and do update
ru: Проверка и обновление

source: Stable
ru: Стабильная

source: Alpha
ru: Альфа

source: Reject
ru: Отклонять

source: Proxy link cannot be empty!
ru: Прокси-ссылка не может быть пустой!

source: Input is not supported or incorrect!
ru: Прокси-ссылка не поддерживается для данного формата!

source: Proxy link contains not encoded whitespace!
ru: Прокси-ссылка содержит пробелы без кодирования!

source: Proxy link can't be parsed!
ru: Прокси-ссылка не может быть распознана!

source: Domain must not contain spaces
ru: Строка с доменом не может содержать пробелы.

source: Domain must contain at least one dot
ru: Строка с доменом должна содержать как минимум одну точку.

source: Suffix must not start or end with a dot or hyphen
ru: Суффикс не должен начинаться или заканчиваться точкой или дефисом

source: Double dots or double hyphens are not allowed
ru: Двойные точки или двойные дефисы не допускаются

source: There must be no empty segments between dots
ru: Между точками не должно быть пустых сегментов

source: Each domain segment must not exceed 63 characters
ru: Каждый сегмент домена не должен превышать 63 символа

source: Suffix length must not exceed 253 characters
ru: Длина суффикса не должна превышать 253 символа

source: Keyword must not contain spaces
ru: Ключевое слово не должно содержать пробелов

source: Only one keyword per field is allowed
ru: В поле допускается только одно ключевое слово

source: Keyword should be at least 2 characters long
ru: Ключевое слово должно быть длиной не менее 2 символов

source: Regexp must not start or end with a space
ru: Регулярное выражение не должно начинаться или заканчиваться пробелом

source: Invalid regular expression:
ru: Некорректное регулярное выражение:

source: Invalid expression in
ru: Некорректное выражение в

source: Status
ru: Состояние

source: Logs
ru: Журнал

source: Connections
ru: Соединения

source: Routing
ru: Маршрутизация

source: Service
ru: Сервис

source: Proxy
ru: Прокси

source: Connection details
ru: Подробности соединения

source: Copied to clipboard
ru: Скопировано в буфер обмена

source: Copy details
ru: Скопировать данные

source: Close
ru: Закрыть

source: Unable to copy to clipboard
ru: Не удалось скопировать в буфер обмена

source: Statistics
ru: Статистика

source: Proto
ru: Прото

source: Connection
ru: Соединение:

source: Host/Sniff
ru: Хост

source: Chains
ru: Цепочка

source: Rule
ru: Правило

source: Active Connections
ru: Активные соединения

source: Source
ru: Источник

source: Destination
ru: Назначение

source: No active connections
ru: Нет активных соединений

source: Connection error
ru: Ошибка подключения

source: Can't connect to proxy API
ru: Невозможно получить данные из API

source: No data
ru: Нет данных

source: No log entries
ru: Нет записей журнала

source: Last updated:
ru: Последнее обновление:

source: Error
ru: Ошибка

source: Refresh
ru: Обновить

source: Scroll to bottom
ru: Прокрутить вниз

source: Data copied to clipboard
ru: Скопировано в буфер обмена

source: Copy log
ru: Скопировать журнал

source: Scroll to top
ru: Прокрутить вверх

source: Newest first
ru: Новые сверху

source: Proxy settings
ru: Настройки прокси

source: Main proxy settings used by Mihomo.
ru: Основные настройки прокси, которые использует Mihomo.

source: Basic settings
ru: Базовые настройки

source: Logging level:
ru: Уровень логов:

source: Choose how much information Mihomo writes to the log. Higher levels help with debugging, but create more log entries.
ru: Выберите, сколько информации Mihomo будет записывать в журнал. Более подробные уровни помогают в диагностике, но создают больше записей.

source: Transparent proxy port:
ru: Порт прозрачного прокси:

source: Port used for redirected TCP/UDP traffic. Change it only if this port is already used by another service.
ru: Порт для перенаправленного TCP/UDP-трафика. Меняйте его только если этот порт уже занят другим сервисом.

source: Enable shared proxy port:
ru: Включить общий порт прокси:

source: Use one port for both HTTP(S) and SOCKS5 connections. This is useful when apps or devices connect to the router as a regular proxy.
ru: Использовать один порт и для HTTP(S), и для SOCKS5. Это удобно, если приложения или устройства подключаются к роутеру как к обычному прокси.

source: Shared proxy port:
ru: Общий порт прокси:

source: Port that accepts both HTTP(S) and SOCKS5 connections from apps and devices on your network.
ru: Порт, который принимает и HTTP(S), и SOCKS5-подключения от приложений и устройств в вашей сети.

source: Use one delay value:
ru: Использовать одну задержку:

source: Use the same delay value when checking response time, so test results stay more consistent.
ru: Использовать одинаковое значение задержки при проверке отклика, чтобы результаты тестов были более стабильными.

source: Try TCP connections in parallel:
ru: Пробовать TCP-подключения параллельно:

source: Try several TCP connections at the same time. This can help on unstable networks, but it may create extra connection attempts.
ru: Пробовать несколько TCP-подключений одновременно. Это может помочь в нестабильной сети, но создаёт дополнительные попытки подключения.

source: Client profile for all connections:
ru: Профиль клиента для всех подключений:

source: How the client identifies itself for supported protocols. Leave the default unless your provider expects a specific profile.
ru: Как сервис будет представляться в поддерживаемых протоколах. Оставьте значение по умолчанию, если провайдер не требует другой профиль.

source: User-Agent for downloads:
ru: User-Agent для загрузки:

source: User-Agent sent when downloading external files such as subscriptions or rule lists.
ru: Как сервис будет представляться при загрузке внешних файлов, например подписок и списков правил.

source: Check whether files changed:
ru: Проверять, изменился ли файл:

source: Only download external files again when the server says they changed. This saves bandwidth and avoids unnecessary updates.
ru: Скачивать внешние файлы заново только если сервер сообщает об изменениях. Это экономит трафик и уменьшает число лишних обновлений.

source: Idle time before connection check:
ru: Простой до проверки соединения:

source: How long to wait with no activity before checking whether the connection is still alive. Shorter values detect dead connections sooner.
ru: Сколько ждать без обмена данными перед проверкой соединения. Меньшие значения быстрее обнаруживают разрыв.

source: Connection check interval:
ru: Интервал проверки соединения:

source: How often to repeat that check after the connection becomes idle.
ru: Как часто повторять такую проверку после простоя.

source: Save profile data:
ru: Сохранять данные профиля:

source: Keep profile data when possible, so selected items can be restored after a restart.
ru: Сохранять данные профиля, чтобы выбранные элементы можно было восстановить после перезапуска.

source: Save fake IP addresses:
ru: Сохранять подменные IP-адреса:

source: Keep assigned fake IP addresses when possible, which can reduce repeated DNS work after restarts.
ru: Сохранять выданные подменные IP-адреса, чтобы после перезапуска реже выполнять повторные DNS-запросы.

source: Controller/API settings
ru: Настройки API

source: Controller bind:
ru: Интерфейс:

source: Select which network will allow access to the API controller and dashboard.
ru: Выберите сеть, из которой будет доступен API-контроллер и панель управления.

source: Enable dashboard:
ru: Включить автозапуск

source: Enable the web dashboard for Mihomo. Turn this on only if you need the dashboard interface.
ru: Включить веб-панель Mihomo. Используйте это только если вам нужен доступ к панели.

source: API password:
ru: API пароль:

source: Password or token required to access the API controller.
ru: Пароль или токен для доступа к API-контроллеру.

source: DNS settings
ru: Настройки DNS

source: DNS listen port:
ru: Порт прослушивания DNS:

source: Proxy DNS server listen port.
ru: Порт прослушивания DNS-сервера прокси.

source: Use system hosts:
ru: Использовать системный hosts:

source: Load DNS entries from system if possible.
ru: Загружать записи DNS из системы, если возможно.

source: DNS cache size:
ru: Размер DNS cache:

source: IP DNS cache size.
ru: Размер кеша DNS для IP.

source: Fake IP filter:
ru: Диапазон поддельных IP:

source: Fake IP working mode.
ru: Диапазон поддельных IP:

source: Fake IP range:
ru: Диапазон поддельных IP:

source: CIDR for fake IP.
ru: CIDR для поддельных IP.

source: Fake IP TTL:
ru: TTL поддельных IP:

source: Time to live time for DNS records from fake IP.
ru: Время актуальности записей механихма поддельных IP (в минутах).

source: Default nameservers:
ru: DNS по умолчанию:

source: Default nameservers used at startup. Recommended to use UDP ones.
ru: DNS сервера по умолчанию при запуске. Рекомендуется использовать UDP-серверы.

source: Invalid nameserver format. Allowed: quic://, https://, tls://, udp:// or IPv4.
ru: Недопустимый формат DNS-сервера. Разрешены: quic://, https://, tls://, udp:// или IPv4.

source: Direct nameservers:
ru: Прямые DNS:

source: Direct nameservers used for DIRECT rules.
ru: DNS сервера, используемые для правил прямого соединения.

source: Proxy nameservers:
ru: DNS сервера для прокси:

source: Nameservers used for proxy servers resolving.
ru: DNS сервера, используемые для разрешения адресов прокси-серверов.

source: Nameservers:
ru: DNS сервера:

source: Nameservers used for all another traffic.
ru: DNS серверы, используемые для всего остального траффика.

source: Use fake IP for domains:
ru: Исключить поддельные IP для доменов:

source: Include selected domains for the Fake IP cache.
ru: Исключить выбранные домены из кэша поддельных IP (может помочь избежать ошибок приложений).

source: Skip fake IP for domains:
ru: Исключить поддельные IP для доменов:

source: Exclude selected domains from the Fake IP cache. This can sometimes help with bugs in apps.
ru: Исключить выбранные домены из кэша поддельных IP (может помочь избежать ошибок приложений).

source: Sniffer settings
ru: Настройки анализатора

source: Enable sniffer:
ru: Включить анализатор:

source: Enable sniffer in proxy.
ru: Включить анализатор:

source: Parse pure IP:
ru: Разбирать IP-адреса без домена:

source: Force domain detection for traffic without resolved domain names.
ru: Принудительное обнаружение для всего трафика, для которого не удалось получить доменное имя.

source: Excluded from sniffer domains:
ru: Исключить домены из анализа:

source: Domains excluded from detailed analysis when possible. Sometimes this can help with errors in apps.
ru: Исключённые домены из детального анализа. Иногда это помогает избежать ошибок в приложениях.

source: Forcefully sniff domains:
ru: Принудительно анализировать домены:

source: Domains included for detailed analysis when possible. Sometimes this can help with errors in apps.
ru: Домены для детального анализа. Иногда это помогает избежать ошибок в приложениях.

source: Exclude from sniffer SRC CIDR traffic:
ru: Исключить из анализа исходящий трафик (SRC CIDR):

source: Exclude from sniffer DST CIDR traffic:
ru: Исключить из анализа входящий трафик (DST CIDR):

source: NTP settings
ru: Настройки NTP

source: Enable NTP client:
ru: Включить NTP-клиент:

source: Enable built-in NTP client in proxy.
ru: Включает встроенный NTP-клиент в прокси.

source: Endpoint NTP server:
ru: NTP-сервер:

source: External NTP server for time syncing.
ru: Внешний NTP-сервер для синхронизации времени.

source: NTP port:
ru: Порт NTP:

source: External NTP server port.
ru: Порт внешнего NTP-сервера.

source: NTP check interval:
ru: Интервал проверки NTP:

source: Interval to check time (in seconds).
ru: Интервал проверки времени (сек).

source: Write to system:
ru: Обновлять в системе:

source: Try to correct system time using the NTP server.
ru: Пытаться корректировать системное время через NTP.

source: Proxies list:
ru: Список прокси:

source: Proxies defined as outbound connections.
ru: Прокси, определённые как исходящие соединения.

source: Basic
ru: Базовые

source: Name:
ru: Имя:

source: Proxy name.
ru: Имя прокси.

source: Name must contain only lowercase letters, digits, and underscores
ru: Имя должно содержать только строчные буквы, цифры и подчёркивания.

source: Mode:
ru: Режим:

source: If selected, allow to define proxy as JSON object.
ru: Позволяет указать параметры прокси в виде JSON-объекта.

source: JSON object:
ru: JSON объект:

source: JSON object with connection parameters.
ru: URI-ссылка с параметрами подключения.

source: Name field must not be defined in object.
ru: Поле имени не должно быть определено в объекте.

source: DIRECT proxy type must be defined without server or port fields.
ru: Тип прокси DIRECT должен быть определён без полей сервера и порта.

source: JSON must contain at least type, server and server fields.
ru: JSON должен содержать как минимум поля type, server и port.

source: Invalid JSON format
ru: Некорректный формат JSON.

source: URL mode:
ru: URL:

source: URI link with connection parameters.
ru: URI-ссылка с параметрами подключения.

source: Connect through:
ru: Подключаться через:

source: Route connections through the specified proxy server, or connect directly if left empty.
ru: Направлять соединения через указанный прокси-сервер или подключаться напрямую, если поле оставлено пустым.

source: Invalid name.
ru: Неверная ссылка.

source: Rules
ru: Правила

source: Use with rules:
ru: Использовать с правилами:

source: Predefined RULE-SET lists, select those which you want to route through proxy. Leave empty if you will use proxy with proxy-groups.
ru: Предустановленные RULE-SET списки. Выберите те, которые хотите направлять через прокси. Оставьте пустым, если используете proxy-groups.

source: Use with custom domain list:
ru: Использовать с правилами:

source: Each entry can be a web link or an absolute local path to an MRS rules file.
ru: Каждая запись может быть веб-ссылкой или абсолютным локальным путём к MRS-файлу с правилами.

source: MRS file is required.
ru: Требуется MRS-файл.

source: Use with custom CIDR list:
ru: Использовать с правилами:

source: Get lists through proxy:
ru: Получать списки через прокси:

source: If selected, RULE-SET lists will be updated through proxy.
ru: При включении RULE-SET списки будут обновляться через прокси.

source: List update interval:
ru: Интервал обновления списков:

source: How often remote lists should be checked for updates, in seconds.
ru: Как часто проверять удалённые списки на обновления, в секундах.

source: Custom rules
ru: Свои правила

source: Domain suffix:
ru: Суффикс домена:

source: Traffic to domains matching this suffix will go through this proxy (example: google.com).
ru: Трафик к доменам с этим суффиксом будет направляться через этот прокси (пример: google.com).

source: Traffic to this IPv4 address or subnet will go through this proxy (example: 1.1.1.1/32).
ru: Трафик к этому IPv4-адресу или подсети будет направляться через этот прокси (пример: 1.1.1.1/32).

source: Source IPv4 CIDR:
ru: Исходный IPv4 CIDR:

source: Traffic from this local IPv4 address or subnet will go through this proxy (example: 192.168.31.212/32).
ru: Трафик с этого локального IPv4-адреса или подсети будет направляться через этот прокси (пример: 192.168.31.212/32).

source: Proxy provider:
ru: Провайдер прокси:

source: Proxy providers are external subscription URLs that dynamically load a list of proxies.
ru: Провайдеры прокси — внешние URL подписок, динамически загружающие список прокси.

source: Subscription URL:
ru: URL подписки:

source: Only http:// or https:// URLs are allowed.
ru: Разрешены только http:// или https:// URL.

source: Your complete subscription URL with http:// or https://.
ru: Полный URL подписки (начинается с http:// или https://).

source: HWID support:
ru: Поддержка HWID:

source: Send HWID data to server with proxy provider request.
ru: Отправлять данные HWID на сервер при запросе провайдера прокси.

source: Update interval:
ru: Интервал обновления:

source: Time interval for subscription update check in seconds.
ru: Интервал проверки обновлений подписки в секундах.

source: Get subscription with:
ru: Получить подписку с:

source: Use selected proxy to get subscription data from server.
ru: Использовать выбранный прокси или группу прокси для загрузки списков RULE-SET.

source: This field cannot be empty
ru: Это поле не может быть пустым

source: Health check
ru: Контроль доступности:

source: Health check:
ru: Контроль доступности:

source: Check URL:
ru: URL проверки:

source: URL for node availability check (required for proxy provider functionality).
ru: URL для проверки доступности узла (нужно для провайдера прокси).

source: Check status:
ru: Ожидаемый статус:

source: Required response status for node availability check (required for proxy provider functionality).
ru: Требуемый HTTP-статус ответа (нужно для провайдера прокси).

source: Check interval:
ru: Интервал проверки:

source: Time interval between health checks in seconds.
ru: Интервал между проверками доступности (сек).

source: Check timeout:
ru: Таймаут проверки:

source: Timeout for each individual health check in milliseconds.
ru: Таймаут каждой проверки доступности (мс).

source: Lazy:
ru: Денивый режим:

source: Filters
ru: Фильтры

source: Filter:
ru: Фильтр:

source: Filter nodes that contain keywords or match regular expressions. Multiple patterns can be separated with | (pipe).
ru: Фильтровать узлы по ключевым словам или регулярным выражениям (несколько шаблонов разделяйте |).

source: Exclude filter:
ru: Исключающий фильтр:

source: Exclude nodes that match keywords or regular expressions. Multiple patterns can be separated with | (pipe).
ru: Исключать узлы, соответствующие ключевым словам или регулярным выражениям (несколько шаблонов разделяйте |).

source: Exclude type:
ru: Исключаемый тип:

source: Exclude type filter.
ru: Фильтр исключения типов.

source: Only lowercase letters, digits, and the '|' separator are allowed. No spaces or special symbols.
ru: Разрешены только строчные буквы, цифры и разделитель '|'. Пробелы и специальные символы запрещены.

source: Unsupported type:
ru: Неподдерживаемый тип:

source: Proxy groups:
ru: Группы прокси:

source: Group proxies for special routing (fallback, load balancing).
ru: Группируйте прокси для специальных сценариев (fallback, балансировка).

source: Proxy group name.
ru: Имя группы прокси.

source: Group type:
ru: Тип группы:

source: Group strategy:
ru: Стратегия группы:

source: Proxies:
ru: Прокси:

source: Providers:
ru: Провайдеры:

source: URL for node availability check (required for proxy group functionality).
ru: URL для проверки доступности узла (нужно для группы прокси).

source: Required response status for node availability check (required for proxy group functionality).
ru: Требуемый HTTP-статус ответа (нужно для группы прокси).

source: Tolerance:
ru: Допуск:

source: Proxies switch tolerance, measured in milliseconds (ms).
ru: Допуск переключения прокси, измеряется в миллисекундах (мс).

source: Max failed times:
ru: Количество неудачных попыток:

source: Predefined RULE-SET lists, select those which you want to route through proxy-group.
ru: Предустановленные RULE-SET списки. Выберите те, которые хотите направлять через proxy-group.

source: Get lists through proxy-group:
ru: Получать списки через proxy-group:

source: If selected, RULE-SET lists will be updated through proxy group.
ru: При включении RULE-SET списки будут обновляться через группу прокси.

source: Traffic to domains matching this suffix will go through the selected proxy group (example: google.com).
ru: Трафик к доменам с этим суффиксом будет направляться через выбранную группу прокси (пример: google.com).

source: Traffic to this IPv4 address or subnet will go through the selected proxy group (example: 1.1.1.1/32).
ru: Трафик к этому IPv4-адресу или подсети будет направляться через выбранную группу прокси (пример: 1.1.1.1/32).

source: Traffic from this local IPv4 address or subnet will go through the selected proxy group (example: 192.168.31.212/32).
ru: Трафик с этого локального IPv4-адреса или подсети будет направляться через выбранную группу прокси (пример: 192.168.31.212/32).

source: DIRECT rules:
ru: Прямые правила:

source: Extra direct rules. These are applied before proxy rules, proxy groups, and block rules.
ru: Дополнительные прямые правила. Они применяются раньше правил прокси, групп прокси и блокировки.

source: Ready-made lists for traffic that should bypass the proxy.
ru: Готовые списки трафика, который должен обходить прокси.

source: Download lists through:
ru: Загружать списки через:

source: Choose which proxy or group should be used when downloading these lists from the internet.
ru: Выберите прокси или группу, через которые эти списки будут загружаться из интернета.

source: Traffic to domains matching this suffix will bypass the proxy (example: google.com).
ru: Трафик к доменам с этим суффиксом будет обходить прокси (пример: google.com).

source: Traffic from this local IPv4 address or subnet will bypass the proxy (example: 192.168.31.212/32).
ru: Трафик с этого локального IPv4-адреса или подсети будет обходить прокси (пример: 192.168.31.212/32).

source: Traffic to this IPv4 address or subnet will bypass the proxy (example: 1.1.1.1/32).
ru: Трафик к этому IPv4-адресу или подсети будет обходить прокси (пример: 1.1.1.1/32).

source: Block rules:
ru: Правила блокировки:
