Repository: SaltyMonkey/justclash
Catalog: luci-app-justclash/po/*/justclash.po
Languages: ru

source: Extra block rules. These are applied before proxy rules and groups, so matching traffic is stopped first.
ru: Дополнительные правила блокировки. Они применяются раньше правил прокси и групп, поэтому подходящий трафик блокируется сразу.

source: Ready-made blocklists for ads and harmful sites. Matching traffic will be blocked. Choose the ones you want to use, or leave this empty.
ru: Готовые списки блокировки рекламы и вредоносных сайтов. Подходящий трафик будет блокироваться. Выберите нужные списки или оставьте поле пустым.

source: Traffic to domains matching this suffix will be blocked (example: google.com).
ru: Трафик к доменам с этим суффиксом будет блокироваться (пример: google.com).

source: Traffic to this IPv4 address or subnet will be blocked (example: 1.1.1.1/32).
ru: Трафик к этому IPv4-адресу или подсети будет блокироваться (пример: 1.1.1.1/32).

source: Shared port rule:
ru: Правило для общего порта:

source: Extra settings for traffic that arrives through the shared proxy port. Use this when that port should behave differently from the default route.
ru: Дополнительные настройки для трафика, который приходит через общий порт прокси. Используйте их, если этот порт должен работать не так, как маршрут по умолчанию.

source: Send traffic to:
ru: Куда направлять:

source: Default rule:
ru: Правило по умолчанию:

source: Used when no other rule matches. This is the fallback action for the remaining traffic.
ru: Используется, если ни одно другое правило не подошло. Это действие по умолчанию для остального трафика.

source: Service settings:
ru: Настройки сервиса:

source: Main service settings and scheduled tasks.
ru: Основные настройки сервиса и задачи по расписанию.

source: Delay startup after boot:
ru: Задержка запуска после включения:

source: Start the service a little later after the router boots. Useful if the router needs extra time to bring up storage, WAN, or other services.
ru: Запускать сервис чуть позже после включения роутера. Полезно, если устройству нужно больше времени для поднятия сети, накопителей или других служб.

source: Startup delay:
ru: Задержка запуска:

source: Choose how many seconds to wait before the first service start after boot.
ru: Выберите, сколько секунд ждать до первого запуска сервиса после включения.

source: Skip startup checks:
ru: Пропустить проверки при запуске:

source: Skip some safety checks during startup. This can speed up startup, but it may hide problems with files, permissions, or system settings.
ru: Пропустить часть проверок безопасности при запуске. Это ускоряет старт, но может скрыть проблемы с файлами, правами доступа или настройками системы.

source: Store downloaded lists in router memory:
ru: Хранить загруженные списки в памяти роутера:

source: If enabled, downloaded rules stay in internal router storage after restart. Use this only if you need it, because frequent writes can wear out built-in flash memory faster.
ru: Если включено, загруженные правила будут сохраняться во внутренней памяти роутера после перезапуска. Используйте это только при необходимости, потому что частые записи ускоряют износ встроенной памяти.

source: Start time sync service:
ru: Запускать службу синхронизации времени:

source: Start time sync so the system clock stays correct for secure connections. Without correct time, secure downloads and API connections may fail.
ru: Синхронизировать время, чтобы защищённые соединения работали корректно. При неверном времени могут не работать безопасные загрузки и API-подключения.

source: Change DNS settings at startup:
ru: Менять DNS при запуске:

source: Update DNS settings automatically when the service starts. Use this if you want JustClash to manage dnsmasq DNS settings for you.
ru: Автоматически обновлять настройки DNS при запуске сервиса. Используйте это, если хотите, чтобы JustClash сам настраивал dnsmasq.

source: Set traffic rules at startup:
ru: Настраивать правила трафика при запуске:

source: Create traffic rules so client devices use the proxy. Disable this only if you already manage traffic redirection rules outside JustClash.
ru: Создавать правила, чтобы устройства в сети использовали прокси. Отключайте только если уже настраиваете перенаправление трафика вне JustClash.

source: Set router traffic rules at startup:
ru: Настраивать правила трафика роутера при запуске:

source: Create traffic rules so the router's own traffic also uses the proxy. Enable this only if you want updates, package installs, and other router traffic to go through the proxy too.
ru: Создавать правила, чтобы трафик самого роутера тоже шёл через прокси. Включайте это только если хотите направлять через прокси обновления, установку пакетов и другой трафик роутера.

source: Client traffic interface:
ru: Интерфейс трафика клиентов:

source: Select which network interface client traffic comes from. This is usually your LAN bridge; do not select WAN unless you know exactly why.
ru: Выберите интерфейс, через который идёт трафик клиентов. Обычно это LAN-мост; не выбирайте WAN без явной причины.

source: Client QUIC traffic:
ru: QUIC-трафик клиентов:

source: Choose how to handle QUIC traffic from devices on your network. The selected mode decides whether this traffic is redirected, bypassed, or blocked.
ru: Выберите, как обрабатывать QUIC-трафик устройств в сети. Выбранный режим определяет, будет ли этот трафик перенаправляться, обходить прокси или блокироваться.

source: Client DoT traffic:
ru: DoT-трафик клиентов:

source: Choose how to handle DoT traffic from devices on your network. The selected mode decides whether this traffic is redirected, bypassed, or blocked.
ru: Выберите, как обрабатывать DoT-трафик устройств в сети. Выбранный режим определяет, будет ли этот трафик перенаправляться, обходить прокси или блокироваться.

source: Client DoQ traffic:
ru: DoQ-трафик клиентов:

source: Choose how to handle DoQ traffic from devices on your network. The selected mode decides whether this traffic is redirected, bypassed, or blocked.
ru: Выберите, как обрабатывать DoQ-трафик устройств в сети. Выбранный режим определяет, будет ли этот трафик перенаправляться, обходить прокси или блокироваться.

source: Client NTP traffic:
ru: NTP-трафик клиентов:

source: Choose how to handle time sync requests from devices on your network. The selected mode decides whether these requests are redirected, bypassed, or blocked.
ru: Выберите, как обрабатывать запросы времени от устройств в сети. Выбранный режим определяет, будут ли эти запросы перенаправляться, обходить прокси или блокироваться.

source: Router NTP traffic:
ru: NTP-трафик роутера:

source: Choose how to handle time sync requests from the router itself. The selected mode decides whether these requests are redirected, bypassed, or blocked.
ru: Выберите, как обрабатывать запросы времени от самого роутера. Выбранный режим определяет, будут ли эти запросы перенаправляться, обходить прокси или блокироваться.

source: Scheduled tasks
ru: Задачи по расписанию

source: Restart Mihomo automatically:
ru: Перезапускать Mihomo автоматически:

source: Restart Mihomo on a schedule, for example once a week or once a day.
ru: Перезапускать Mihomo по расписанию, например раз в день или раз в неделю.

source: Update Mihomo automatically:
ru: Обновлять Mihomo автоматически:

source: Choose whether Mihomo should update automatically, and under what conditions.
ru: Выберите, нужно ли обновлять Mihomo автоматически и при каких условиях.

source: Update channel:
ru: Канал обновлений:

source: Choose which release channel to use for automatic Mihomo updates. Stable is safer, while newer channels may include newer features and newer bugs.
ru: Выберите канал для автоматических обновлений Mihomo. Стабильный канал безопаснее, а более новые каналы могут содержать и новые функции, и новые ошибки.

source: Restart schedule:
ru: Расписание перезапуска:

source: Use cron format to choose when Mihomo should restart automatically.
ru: Используйте формат cron, чтобы указать время автоматического перезапуска Mihomo.

source: Invalid schedule format. Use: 'minute hour day month weekday' (for example, '0 3 * * 0')
ru: Неверный формат расписания. Используйте: 'minute hour day month weekday' (например, '0 3 * * 0')

source: Update schedule:
ru: Расписание обновлений:

source: Use cron format to choose when Mihomo should check for updates automatically.
ru: Используйте формат cron, чтобы указать время автоматической проверки обновлений Mihomo.

source: Enabled
ru: Включен

source: Enable or disable this proxy entry without removing it.
ru: Включите или отключите этот прокси, не удаляя его.

source: Enable or disable this proxy provider without removing it.
ru: Включите или отключите этого провайдера прокси, не удаляя его.

source: Enable or disable this proxy group without removing it.
ru: Включите или отключите эту группу прокси, не удаляя ее.

source: Running
ru: Запущен

source: Stopped
ru: Остановлен

source: Start on boot
ru: Запуск при старте

source: Router model
ru: Модель роутера

source: OpenWrt version
ru: Версия OpenWrt

source: Latest release
ru: Последний релиз

source: Installed version
ru: Установленная версия

source: LuCI version
ru: Версия LuCI

source: Mihomo core
ru: Ядро Mihomo

source: Please wait...
ru: Пожалуйста, подождите.

source: Dangerous action!
ru: Опасное действие!

source: No response
ru: Нет ответа

source: Copy to clipboard
ru: Скопировать

source: Dismiss
ru: Закрыть

source: Timeout
ru: Таймаут

source: Loading...
ru: Загрузка...

source: Current status:
ru: Текущий статус:

source: Running command...
ru: Выполняется команда...

source: Please wait.
ru: Пожалуйста, подождите.

source: Start
ru: Запустить

source: Restart
ru: Перезапустить

source: Stop
ru: Остановить

source: Enable autostart
ru: Включить автозапуск

source: Disable autostart
ru: Отключить автозапуск

source: Run diagnostics
ru: Запустить диагностику

source: Diagnostic report
ru: Отчёт диагностики

source: Update core
ru: Обновить ядро

source: Update Mihomo core
ru: Обновить ядро Mihomo

source: Show Mihomo config
ru: Показать конфигурацию Mihomo

source: Mihomo config
ru: Конфигурация Mihomo

source: Do not share your Mihomo config with anyone.
ru: Никому не показывайте и не передавайте конфигурацию Mihomo.

source: Show service config
ru: Показать конфигурацию сервиса

source: Service config
ru: Конфигурация сервиса

source: Do not share your service config with anyone.
ru: Никому не показывайте и не передавайте конфигурацию сервиса.

source: Refresh service data
ru: Обновить данные сервиса
